# Задача 1
# Напишите программу которая на вход принимает число N 
# и выдаёт последовательность из N членов

for i in range (int(input("Введите число: "))): 
    print ((-3)**i, end = ' ') # .  end = ' ' - это мы запретили переходить на новую строчку
